<?php
// +------------------------------------------------------------------>>>>
// |            PHP IS THE BEST LANGUAGE IN THE WORLD 
// +------------------------------------------------------------------>>>>
// |    User: FrankLee
// +------------------------------------------------------------------>>>>
// |    Date: 2019/3/31 Time: 1:55 AM
// +------------------------------------------------------------------>>>>
// |                                   Author: FrankLee <frank227@163.com>
// +------------------------------------------------------------------>>>>


//
 return [

// 模板参数替换
'view_replace_str'       => array(
    '__CSS__'    => '/static/admin/css',
    '__NORMALCSS__' => '/static/css',
    '__JS__'     => '/static/admin/js',
    '__IMG__' => '/static/admin/images',
),
    'mall' =>array(
    ['id' => 0, 'title' => '全部商城'],
    ['id' => 1, 'title' => '赶谷商城'],
    ['id' => 2, 'title' => '淘宝商城'],
    ['id' => 3, 'title' => '拼多多'],
    ['id' => 4, 'title' => '亿起发'],
    ['id' => 5, 'title' => '京东'],
    ['id' => 6, 'title' => '天猫'],
),

    // 404指向hell
//    'http_exception_template'=>[
//      404 => 'admin/index'
//    ],

    // 管理员状态
    'user_status' => [
    '1' => '正常',
    '2' => '禁用'
],
    // 角色状态
    'role_status' => [
    '1' => '启用',
    '2' => '禁用'
],
];
